"""
 Написать программу, которая генерирует в указанных пользователем границах:
    ● случайное целое число,
    ● случайное вещественное число,
    ● случайный символ.
  Для каждого из трех случаев пользователь задает свои границы диапазона.
  Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
  Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.
"""
import random

answer = input("Что будем генерировать?\n Для генерации целого числа введите 'i';\n для генерации действительного "
               "числа 'f';\n для генерации символа любое другое значение: ")
if answer == 'i' or answer == 'f':
    bgn = input('От какого числа генерируем ')
    stp = input('До какого числа генерируем ')
    if answer == 'f':
        result = random.uniform(float(bgn), float(stp))
    else:
        result = random.randrange(int(bgn), int(stp) + 1)
else:
    bgn = ord(input('От какого символа генерируем (от a до z)? '))
    stp = ord(input('До какого символа генерируем (от a до z)? '))
    result = chr(random.randrange(int(bgn), int(stp)) + 1)
print(result)
