"""
1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа. Числа и знак операции
вводятся пользователем. После выполнения вычисления программа не завершается, а запрашивает новые данные для
вычислений. Завершение программы должно выполняться при вводе символа '0' в качестве знака операции. Если
пользователь вводит неверный знак (не '0', '+', '-', '*', '/'), программа должна сообщать об ошибке и снова
запрашивать знак операции. Также она должна сообщать пользователю о невозможности деления на ноль,
если он ввел его в качестве делителя.
"""


def calc():
    func = input('Введите 0 для выхода или символ операции (+, -, *, /) ')
    if func == '0':
        return f'Конец'
    if func == '+' or func == '-' or func == '*' or func == '/':
        num_1 = input('Введите первое число ')
        num_2 = input('Введите второе число ')
        else:
            if func == '+':
                print(float(num_1) + float(num_2))
            elif func == '-':
                print(float(num_1) - float(num_2))
            elif func == '*':
                print(float(num_1) * float(num_2))
            else:
                if num_2 == '0':
                    print('На нуль может делить только Чак Норис')
                else:
                    print(float(num_1) / float(num_2))
    else:
        print('Я не знаю такой операции...')
    return calc()


print(calc())

"""
Второй вариант до вызова функции запрашивать num_1, num_2 и func и передавать их в функцию,
а перед завершением функции снова их запрашивать и передавать, но мне показалось это не рационально.
"""

"""
4. Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,… Количество элементов (n) вводится с клавиатуры.
6. В программе генерируется случайное целое число от 0 до 100. Пользователь должен его отгадать не более чем за 10 попыток. После каждой неудачной попытки должно сообщаться, больше или меньше введенное пользователем число, чем то, что загадано. Если за 10 попыток число не отгадано, вывести правильный ответ.
7. Напишите программу, доказывающую или проверяющую, что для множества натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2, где n — любое натуральное число.
8. Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел. Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.
9. Среди натуральных чисел, которые были введены, найти наибольшее по сумме цифр. Вывести на экран это число и сумму его цифр.
"""
