"""
 1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа. Числа и знак операции
 вводятся пользователем. После выполнения вычисления программа не завершается, а запрашивает новые данные для
 вычислений. Завершение программы должно выполняться при вводе символа '0' в качестве знака операции. Если
 пользователь вводит неверный знак (не '0', '+', '-', '*', '/'), программа должна сообщать об ошибке и снова
 запрашивать знак операции. Также она должна сообщать пользователю о невозможности деления на ноль,
 если он ввел его в качестве делителя.

 Диаграммы:
 https://drive.google.com/file/d/13csl0fweoRhy07UkNxrZX9ASXwtIA9NA/view?usp=sharing
"""


def calc():
    func = input('Введите 0 для выхода или символ операции (+, -, *, /) ')
    if func == '0':
        return f'Конец'
    if func == '+' or func == '-' or func == '*' or func == '/':
        num_1 = input('Введите первое число ')
        num_2 = input('Введите второе число ')
        if func == '+':
            print(float(num_1) + float(num_2))
        elif func == '-':
            print(float(num_1) - float(num_2))
        elif func == '*':
            print(float(num_1) * float(num_2))
        else:
            if num_2 == '0':
                print('На нуль может делить только Чак Норис')
            else:
                print(float(num_1) / float(num_2))
    else:
        print('Я не знаю такой операции...')
    return calc()


print(calc())
